In [2]:
import pandas as pd
import numpy as np

In [3]:
data1 = {
    'id' : [1 , 2 , 3],
    "name" : ['Ahmed' , 'Fatima' , 'Ali'] , 
    'age' : [28 , 32 , 24]
}

df1 = pd.DataFrame(data1)

In [ ]:
data2 = {
    'id' : [1 , 2 , 4] ,
    'city' : ['Karachi' , 'Lahore' , 'Islamabad'] ,
    'age' : ['Engineer' , 'Doctor' , 'Teacher' ]
}

df2 = pd.DataFrame(data2)

In [4]:
df1.head()

   id    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [5]:
df2.head()

   id       city       age
0   1    Karachi  Engineer
1   2     Lahore    Doctor
2   4  Islamabad   Teacher

In [6]:
merged_df = pd.merge( df1 , df2 , on = 'id' , how = "inner")

In [7]:
merged_df

   id    name  age_x     city     age_y
0   1   Ahmed     28  Karachi  Engineer
1   2  Fatima     32   Lahore    Doctor

## **Now we can see that the third row didn't get merged because of it's unique `id`**

### **Now we will make the id's same and see how it affects the dataFrame**

In [8]:
data1 = {
    'id' : [1 , 2 , 3],
    "name" : ['Ahmed' , 'Fatima' , 'Ali'] , 
    'age' : [28 , 32 , 24]
}

df1 = pd.DataFrame(data1)

In [11]:
data2 = {
    'id' : [1 , 2 , 3] ,
    'city' : ['Karachi' , 'Lahore' , 'Islamabad'] ,
    'age' : ['Engineer' , 'Doctor' , 'Teacher' ]
}

df2 = pd.DataFrame(data2)

In [12]:
merged_df = pd.merge( df1 , df2 , on = 'id' , how = "inner")
merged_df

   id    name  age_x       city     age_y
0   1   Ahmed     28    Karachi  Engineer
1   2  Fatima     32     Lahore    Doctor
2   3     Ali     24  Islamabad   Teacher

### **Now the data has successfully been merged completely based on `id`**